000
0101
0102
100
1900
1900s
1950s
1968
1970s
1983
1990
1990s
1991
1992
1993
1994
1995
1996
1997
1998
1999
1stld
200
2000
2001
202
20th
212
21st
2ndtake
2takes
300
400
404
4204
500
526
5456
556
800
888
90s
abc
ability
able
accept
accepted
according
account
accused
act
acting
action
active
actor
actually
adam
add
added
adding
addition
additional
address
administration
adv02
advantage
advertising
advice
adviser
affair
affect
affected
afghanistan
afraid
africa
african
afternoon
age
agencies
agency
agent
ago
agree
agreement
ahead
aim
air
airlines
airport
alarm
alexander
algeria
algerian
allen
allow
allowed
aloni
alway
amazing
america
american
amid
amount
amp
analyst
anasazi
ancient
andrew
angeles
animal
ann
announced
annual
answer
anticipating
anymore
apartment
apparently
appeared
applewhite
approach
april
archbishop
architect
architecture
area
areas
aren
arena
argue
arizona
arkansas
arm
armed
army
array
arrest
arrested
arrival
arrived
art
ask
asked
assignment
assistant
association
athletes
athletic
atlanta
attack
attempt
attendance
attended
attention
audience
august
australia
author
authorities
authority
autobiography
automatically
avenue
average
aviation
avoid
award
baby
backed
background
backup
backward
bad
ball
baltimore
ban
band
bank
banner
bar
barbara
barely
base
baseball
based
basic
basketball
battle
bay
beach
beamer
beamon
bear
beat
beating
began
begin
beginning
begun
beijing
belatedly
belgian
belichick
belief
believe
believed
believes
bell
beneath
benefit
bianca
bible
big
bigger
biggest
bill
billion
bird
birth
bishop
bit
black
block
blood
blue
board
boat
bob
bobby
body
bomb
bond
bones
book
boot
border
boris
born
bos
boston
bowden
bowl
boy
bradley
brain
brazil
break
brien
bring
britain
british
broad
broadcast
broadway
broken
brooklyn
brother
brought
brown
bruce
bruin
bryant
budget
buffalo
bug
build
building
built
bull
burger
burn
burundi
busch
buses
bush
business
businesses
butler
buy
buying
calendar
calif
california
call
called
calling
camp
campaign
campaigning
canadian
canceled
candidate
candidates
cannibalism
cap
capital
capsule
car
card
cardinal
care
career
carefully
carl
carolina
carroll
carruth
carry
carrying
carter
case
cases
casey
cash
cast
casualties
cat
catch
catching
category
catholic
caught
caused
celebrate
celebrating
celebration
cell
celtic
center
central
century
certainly
chairman
challenge
challenger
champagne
championship
chance
chances
change
changed
chaos
character
charged
charges
charles
charlotte
chechen
chechnya
check
chicago
chief
child
children
china
chinese
chip
choice
chose
chris
christ
christian
christmas
christopher
church
cited
cities
citizen
citizenship
city
civil
civilian
claim
class
clean
clear
clearly
cleveland
client
clinton
clock
close
closed
closer
cloud
club
cnn
coach
coaches
coaching
coalition
coast
code
cold
collection
college
colonial
colonist
color
colorado
colt
columbus
column
columnist
com
comb
combination
comes
comfortable
coming
command
commentary
commerce
commercial
commission
commissioner
commitment
committed
committee
common
communication
communist
community
companies
company
compared
compensation
compete
competition
competitive
complete
completed
computer
computing
concern
concerned
concert
condition
conference
confetti
confidence
conflict
confused
congo
congress
congressional
connor
consecutive
consider
considered
constantly
constitution
consultant
contact
contender
contest
continue
continued
continues
contract
contrast
control
controlled
convention
convinced
cook
cooking
coordinator
core
corner
corp
corporate
cost
cotton
couch
couldn
council
count
countdown
countries
country
county
coup
couple
courage
course
court
cover
coverage
covered
cowboy
cox
coxnet
coxnew
create
created
credit
crew
crime
crimes
criminal
crisis
critic
critical
criticism
crop
cross
crowd
crowded
crucial
crush
crystal
cuba
cuban
cultural
culture
cup
current
customer
cut
dad
daily
dallas
damage
dame
dan
dancer
dancing
danger
dangerous
dark
data
date
dates
daughter
david
davis
dawn
dead
deal
dealing
death
debate
dec
decade
decades
december
decided
decision
declared
decline
deep
defense
defensive
deficit
delegates
delivered
demand
democracy
democrat
democratic
denver
department
depend
depot
deputy
des
describes
design
designed
desire
desk
despite
detroit
developed
development
devil
dictionary
didn
died
diego
diesel
difference
difficult
digit
digital
dinner
direct
direction
director
disappointed
disaster
discipline
discover
discuss
display
distance
district
division
document
doesn
dog
dole
dollar
dolphin
dome
domestic
donald
door
double
doubt
downtown
dozen
draft
draw
drawn
dream
drew
drive
driver
driving
drop
dropped
drove
drug
duty
eagles
earlier
early
earned
earth
east
eastern
easy
eat
eating
eck
economic
economy
edition
editor
education
edward
effect
effective
effort
eighth
elected
election
electric
electronic
elias
elite
elizabeth
emerge
emergency
employees
empty
end
ended
ending
energy
engaged
engine
england
english
enjoy
enormous
enter
entering
entertainment
entire
epic
episodes
equal
era
error
especially
espn
essay
est
established
estimated
estimates
ethnic
europe
european
eve
evening
event
eventually
evidence
evil
exception
executive
exist
exp
expansion
expect
expectation
expected
experience
experienced
expert
explain
extra
extraordinary
extremely
eye
eyes
face
faces
facilities
fact
factor
failed
failure
failures
faith
fall
falling
fame
families
family
famous
fan
farm
farmer
fassel
fast
faster
fastest
father
favorite
fbc
fbn
fear
feared
feature
feb
february
federal
feel
feeling
feet
fell
fellow
felt
festivities
fewer
fff
ffff
fffx
ffx
ffxf
ffxx
field
fight
fighter
fighting
figure
figures
file
filed
fill
filled
film
final
finally
financial
find
finding
fine
finger
finish
finished
fire
fired
firework
firm
fisher
fix
fixed
flag
fleisher
flesh
flight
floor
florida
fly
flying
focus
focused
follow
food
foot
football
force
forced
forces
forecast
foreign
forges
forget
form
formed
fortson
forward
fought
found
foundation
fourth
france
franchise
francisco
frank
free
freedom
french
frequently
freshman
friday
friend
friendly
front
full
fun
fund
fundamental
future
fxf
fxff
fxfx
fxx
gain
game
games
gap
garden
garvey
gary
gas
gate
gathered
gathering
gave
general
generally
generation
generator
genocide
george
georgia
german
germany
getting
giant
gift
gilmour
girl
gisborne
giuliani
give
giving
glenn
glitch
glitches
global
globe
goal
god
goes
going
gold
golden
golf
gore
gov
government
grand
grandfather
grandmother
graphic
gray
greater
greatest
green
greene
greenwich
greg
grew
grid
griffey
ground
group
grow
growing
grown
growth
grozny
guard
guerrillas
guess
guest
gun
guy
hair
half
hall
hampshire
hand
handed
happen
happened
happy
hard
harrison
harry
hasn
hatred
haven
hawk
head
headed
health
hear
heard
hearing
heart
heavily
heavy
heisman
held
help
helped
helping
henry
high
higher
highest
highlight
highly
hijacker
hijacking
hill
hispanic
historian
historic
history
hit
hobson
hockey
hokies
hold
holding
holiday
hollywood
holy
home
hong
honor
hope
hopes
hoping
horn
hornet
horse
hospital
host
hostages
hot
hotel
hour
house
houston
howard
hsi
huge
human
humanity
hundred
hunting
hurt
husband
hutu
hybrid
hype
idea
ideal
ideas
ill
illegal
image
images
immediately
immigrant
immigration
impact
importance
important
impossible
improve
improvement
incident
include
included
including
increase
increased
increasing
independence
independent
india
indian
individual
industrial
industry
inflation
influence
information
injured
injuries
injury
inside
intelligence
interest
interested
interesting
international
internet
intersection
interview
investigation
investment
involved
iowa
iqbal
irish
islamic
island
isn
israel
issue
issued
issues
item
jack
jackson
james
jan
jane
january
japan
japanese
jason
jerry
jersey
jerusalem
jesus
jet
jew
jim
job
joe
john
johnson
join
joined
jones
journal
journalist
journey
jump
june
junior
justice
juvenile
kan
kansas
keeping
keith
kennedy
kevin
key
keyword
kick
kid
killed
killer
killing
kind
king
knee
knew
knick
known
kong
koskinen
kraft
kremlin
kyrgyz
kyrgyzstan
labor
lack
lady
laker
lakes
land
landmark
language
lardner
laredo
large
largely
larger
largest
laser
late
later
latest
law
lawyer
lead
leader
leadership
leading
league
leagues
learn
learned
leave
leaves
led
lee
left
leg
lenin
lesson
letter
level
lewis
liberal
lifetime
light
likely
likes
limit
lincoln
line
linebacker
lines
linked
list
listen
live
lived
lives
living
local
locator
london
longer
longhorn
look
looked
looking
los
lose
losing
loss
losses
lost
lot
lott
louis
love
low
lower
lucas
luck
machines
mad
magazine
mail
main
maine
major
majority
makes
making
mall
managed
management
manager
manas
manaschis
manhattan
manner
map
march
marijuana
mark
market
marketing
martin
mary
maryland
mass
master
material
matter
maurice
maybe
mayor
mccain
mean
meaning
meant
medal
media
medical
meet
meeting
megaart
member
memorial
merely
message
met
meter
mexican
mexico
miami
michael
microchip
mid
middle
midnight
midtown
mighty
migration
mike
mile
miles
militant
military
millenium
millennial
millennium
miller
million
mind
minister
ministry
minor
minority
minute
minutes
missed
missing
mississippi
mistakes
mitten
model
modern
mom
moment
momentum
monday
money
monitoring
month
moon
moral
morning
moscow
mother
mount
mountain
mouth
move
moved
movement
moves
movie
moving
mta
muhammad
murder
murray
music
muslim
mutual
nadelmann
named
names
narrow
nation
national
native
natural
nature
nba
nearly
nebraska
need
needed
negative
neighborhood
net
network
newscom
newspaper
newyear
nfc
nfl
nhl
nice
night
nippon
nomination
nominee
non
noon
normal
north
northern
note
noted
notes
november
nuclear
number
nyt
nytimes
occasion
occur
occurred
oct
october
odd
offense
offensive
offer
offered
offering
office
officer
offices
official
officially
ohio
oil
older
olives
olympic
online
open
opened
opening
operation
opinion
opportunity
option
optional
order
ordinary
organization
original
orlando
orlean
outsider
outstanding
overseas
owner
package
packed
packer
page
paid
pakistan
panther
paper
parade
parcell
parent
park
part
participation
parties
party
pass
passed
passenger
passes
passing
past
pat
patriot
paul
pay
paying
pdf
peace
percent
perfect
performance
performed
performer
perhap
period
person
personal
personally
personnel
perspective
pete
peter
phenomenon
phil
philadelphia
phoenix
phone
photo
photograph
photos
physical
pick
picked
piece
pilot
pitcher
pittsburgh
place
places
plain
plan
plane
planned
planning
plano
plant
play
played
player
playing
playoff
plenty
plummer
poem
point
pointed
police
policy
politic
political
politician
poll
pollution
pool
poor
pop
pope
popular
popularity
population
position
positive
post
potential
pound
power
powerful
practice
practices
prayer
pre
precaution
predicted
preferred
preparation
prepare
prepared
preparing
present
preserve
presidency
president
presidential
press
pressure
pretty
previous
price
prices
primaries
primary
prime
primeau
priority
prison
private
prize
pro
problem
process
produced
product
professional
professor
program
progress
project
promised
property
proposal
prosecutor
protect
proud
provided
public
published
pull
pulled
purchases
pushed
pushing
put
putin
putting
quality
quarter
quarterback
queen
question
quick
quickly
quiet
quit
race
races
racial
racing
radio
rain
raise
raised
raising
ran
random
range
rank
ranked
ranking
rate
rating
ray
razorback
reach
reached
reaction
read
ready
real
realize
reason
rebel
rebound
recall
received
receiver
receiving
recent
recently
record
recording
red
reflect
reflected
reform
refused
region
regular
related
relation
relatives
release
released
religious
remain
remark
remarkable
remember
remembered
remote
rent
repeat
replace
replacement
report
reported
reporter
represent
republic
republican
reputation
research
resident
resignation
respect
response
ressam
rest
restaurant
result
resumes
retailer
retired
retirement
return
returned
returning
reveler
review
revolution
rice
rich
richard
richardson
rick
riley
ring
rio
riot
rise
rising
risk
ritual
rival
river
road
robert
rock
rocket
role
roll
rolled
rollover
rome
rookie
room
roosevelt
rose
round
row
rule
rules
rumor
run
runner
running
rushing
rusie
russia
russian
rwanda
sack
safety
saigh
salary
sales
san
sander
sat
satellite
saturday
savannah
saw
say
saying
scale
scene
schedule
scheduled
scholar
scholastic
school
science
scientist
score
scored
scores
scoring
scott
screen
screenwriter
search
season
seat
seattle
secret
secretary
section
sector
security
seeing
seek
seeking
seemingly
seen
seize
selected
selection
sell
seminoles
sen
senate
senator
send
senior
sense
sentences
separate
series
seriously
served
service
services
serving
session
set
setting
settled
seventh
shape
share
shift
shoot
shooting
short
shortly
shot
shoulder
show
showed
shower
shown
shut
side
sides
sign
signed
significance
significant
signing
silver
similar
simon
simple
simply
singer
singing
single
siren
sister
sit
site
sites
situation
size
skeleton
skill
sky
slaughter
sleep
slightly
slot
small
smaller
smith
smoothly
snow
sobchak
soccer
social
societies
society
software
sold
soldier
son
song
soon
sophisticated
sort
sought
soul
sound
source
south
southern
soviet
sox
space
spanish
speak
special
specific
spectacle
spectacular
spectator
speech
speed
spend
spending
spent
spirit
spokesman
spokeswoman
sport
spot
spread
spring
sprinter
spur
square
stadium
staff
stage
stand
standard
standing
stanford
stanley
star
start
started
starter
starting
statement
states
station
status
stay
stayed
steadily
steady
steel
step
steve
stock
stood
stop
stopped
stores
stories
storm
story
straight
streak
street
strong
struck
student
studies
study
style
subject
submitted
success
successor
suddenly
suffered
sugar
summer
summoned
sun
sunday
super
supply
support
supporter
supposed
sure
surgery
surprise
surprising
surprisingly
surrounding
survive
survived
susan
suspended
swept
swing
switched
syracuse
system
table
tackle
takes
taking
talent
talk
talking
tampa
task
tax
taylor
teacher
team
teammates
tech
technological
technology
telecommunication
television
tell
temporarily
temporary
ten
tended
tennessee
tennis
tension
term
terrorism
terrorist
test
testing
texas
text
thing
think
thinking
thomas
thought
thousand
threat
throw
thursday
ticket
tie
ties
tiger
tight
tim
times
timessquare
tip
tired
title
today
todd
tokyo
told
tom
tomjanovich
tonight
tony
took
top
topic
total
touchdown
tough
tourist
tower
town
townsend
track
trade
traded
tradition
traditional
traditionally
traffic
trail
train
training
transferor
transition
transportation
travel
traveled
trend
trial
tried
trim
trip
troop
trouble
truck
true
truly
trump
trust
truth
try
trying
tuesday
turn
turned
turner
tutsi
undated
understand
union
unit
united
university
unrestricted
unusual
upbeat
upper
usual
valley
values
van
vast
verge
version
veteran
vice
vick
victim
victories
victory
video
view
viewed
violence
virginia
virtually
vision
visit
visitor
vladimir
voice
volunteer
vote
voter
wait
waited
waiting
walk
wall
walter
want
wanted
war
warn
warned
warning
warrick
washington
wasn
watch
watched
watching
water
weapon
wearing
weather
web
wednesday
week
weekend
weekly
welcomed
weren
west
western
white
wide
widely
widespread
wieck
wife
wild
william
win
wind
window
wing
winner
winning
winter
wisconsin
withdrawal
woman
women
won
wonder
wood
woodyard
word
wordage
worked
worker
working
worldwide
worried
worse
worst
worth
wouldn
writer
writes
writing
written
wrong
wrote
www
xff
xfff
xffx
xffxf
xfx
xxf
y2k
yard
yeltsin
yes
york
young
youth
zealand
zone
zones
